## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 8 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.scan_files_certificate will be created
  + resource "aws_acm_certificate" "scan_files_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "scan-files.alpha.canada.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scan-files.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "scan-files.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.scan-files.alpha.canada.ca",
        ]
      + tags                      = {
          + "CostCenter" = "scan-files-production"
        }
      + tags_all                  = {
          + "CostCenter" = "scan-files-production"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.scan_files_certificate_validation will be created
  + resource "aws_acm_certificate_validation" "scan_files_certificate_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_api_gateway_base_path_mapping.api will be created
  + resource "aws_api_gateway_base_path_mapping" "api" {
      + api_id      = "zjyu1t6h7e"
      + domain_name = "scan-files.alpha.canada.ca"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date      = "2021-11-17T19:43:21Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:ca-central-1:806545929748:zjyu1t6h7e/" -> (known after apply)
      ~ id                = "w512xy" -> (known after apply)
      ~ invoke_url        = "https://zjyu1t6h7e.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ stage_description = "c3fe628273a28cbff117f04d8216af03" -> "0f90ee8d3253e21cdf1b4d5e2cd8ce18" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_domain_name.api will be created
  + resource "aws_api_gateway_domain_name" "api" {
      + arn                      = (known after apply)
      + certificate_upload_date  = (known after apply)
      + cloudfront_domain_name   = (known after apply)
      + cloudfront_zone_id       = (known after apply)
      + domain_name              = "scan-files.alpha.canada.ca"
      + id                       = (known after apply)
      + regional_certificate_arn = (known after apply)
      + regional_domain_name     = (known after apply)
      + regional_zone_id         = (known after apply)
      + security_policy          = "TLS_1_2"
      + tags_all                 = (known after apply)

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "w512xy" -> (known after apply)
        id                    = "ags-zjyu1t6h7e-v1"
        tags                  = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.scan_files_A will be created
  + resource "aws_route53_record" "scan_files_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "scan-files.alpha.canada.ca"
      + type            = "A"
      + zone_id         = "Z09208862AM3U6FRXOHM8"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.scan_files_dns_validation["*.scan-files.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "scan_files_dns_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z09208862AM3U6FRXOHM8"
    }

  # aws_route53_record.scan_files_dns_validation["scan-files.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "scan_files_dns_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z09208862AM3U6FRXOHM8"
    }

Plan: 8 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.scan_files_certificate"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]

10 tests, 8 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
